In [35]:
import pandas as pd
import numpy as np
from sklearn import linear_model
from word2number import w2n

In [20]:
df=pd.read_csv("hiring.csv")
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [25]:
df.rename(columns={"test_score(out of 10)":"test_score"},inplace=True)

In [30]:
df.rename(columns={"interview_score(out of 10)":"interview_score"},inplace=True)
df.rename(columns={"interview_score(out of 10)":"interview_score"})
df.rename(columns={"salary($)":"salary"},inplace=True)
df

  experience  test_score  interview_score  salary
0       zero         8.0                9   50000
1       zero         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         NaN                7   72000
7     eleven         7.0                8   80000

In [28]:
df.experience=df.experience.fillna("zero")
df.experience

0      zero
1      zero
2      five
3       two
4     seven
5     three
6       ten
7    eleven
Name: experience, dtype: object

In [31]:
import math
median_testscore=df.test_score.median()
median_testscore

8.0

In [33]:
df.test_score=df.test_score.fillna(median_testscore)
df

  experience  test_score  interview_score  salary
0       zero         8.0                9   50000
1       zero         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         8.0                7   72000
7     eleven         7.0                8   80000

In [36]:
w2n.word_to_num(df.experience)

ValueError: Type of input is not string! Please enter a valid number word (eg. 'two million twenty three thousand and forty nine')